STMicroelectronics/STM32CubeL5/Drivers/BSP/STM32L552E-EV/stm32l552e_eval_sd.c
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsd);

  /* Check whether HSI48 is enabled or not */
  HAL_RCC_GetOscConfig(&RCC_OscInitStruct);
  if(RCC_OscInitStruct.HSI48State != RCC_HSI48_ON)
  {
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI48;
    RCC_OscInitStruct.HSI48State     = RCC_HSI48_ON;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_NONE;
    ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);
  }

  if (ret == HAL_OK)
  {
    /* Configure the Eval SDMMC1 clock source. The clock is derived from the HSI48 */
    RCC_PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_SDMMC1;
    RCC_PeriphClkInit.Sdmmc1ClockSelection = RCC_SDMMC1CLKSOURCE_HSI48;
    ret = HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphClkInit);

    if (ret == HAL_OK)
    {
      /* Enable SDMMC1 clock */
      __HAL_RCC_SDMMC1_CLK_ENABLE();

      /* Enable GPIOs clock */
      __HAL_RCC_GPIOC_CLK_ENABLE();
      __HAL_RCC_GPIOD_CLK_ENABLE();

      /* Common GPIO configuration */
      gpioinitstruct.Mode      = GPIO_MODE_AF_PP;
      gpioinitstruct.Pull      = GPIO_PULLUP;
      gpioinitstruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
      gpioinitstruct.Alternate = GPIO_AF12_SDMMC1;

      /* GPIOC configuration */
      gpioinitstruct.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
      HAL_GPIO_Init(GPIOC, &gpioinitstruct);

      /* GPIOD configuration */
      gpioinitstruct.Pin = GPIO_PIN_2;
      HAL_GPIO_Init(GPIOD, &gpioinitstruct);

      /* NVIC configuration for SDMMC1 interrupts */
      HAL_NVIC_SetPriority(SDMMCx_IRQn, BSP_SD_IT_PRIORITY, 0);
      HAL_NVIC_EnableIRQ(SDMMCx_IRQn);
    }
  }
}

/**
  * @brief  De-Initializes the SD MSP.
  * @param  hsd  SD handle
  * @retval None
  */
static void SD_MspDeInit(SD_HandleTypeDef *hsd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsd);

  /* NVIC configuration for SDMMC1 interrupts */
  HAL_NVIC_DisableIRQ(SDMMCx_IRQn);

  /* Disable SDMMC1 clock */
  __HAL_RCC_SDMMC1_CLK_DISABLE();

  /* Disable common GPIO configuration */
  /* GPIOC configuration */
  HAL_GPIO_DeInit(GPIOC, (GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12));

  /* GPIOD configuration */
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_2);
}

#if (USE_HAL_SD_REGISTER_CALLBACKS == 1)
/**
  * @brief SD Abort callbacks
  * @param hsd  SD handle
  * @retval None
  */
static void SD_AbortCallback(SD_HandleTypeDef *hsd)
{
  uint32_t instance = 0;

  do
  {
    if (hsd == &hsd_sdmmc[instance])
    {
      BSP_SD_AbortCallback(instance);
    }
    instance ++;
  }while (instance < SD_INSTANCES_NBR);
}

/**
  * @brief Tx Transfer completed callbacks
  * @param hsd  SD handle
  * @retval None
  */
static void SD_TxCpltCallback(SD_HandleTypeDef *hsd)
{
  uint32_t instance = 0;

  do
  {
    if (hsd == &hsd_sdmmc[instance])
    {
      BSP_SD_WriteCpltCallback(instance);
    }
    instance ++;
  }while (instance < SD_INSTANCES_NBR);
}

/**
  * @brief Rx Transfer completed callbacks
  * @param hsd  SD handle
  * @retval None
  */
static void SD_RxCpltCallback(SD_HandleTypeDef *hsd)
{
  uint32_t instance = 0;

  do
  {
    if (hsd == &hsd_sdmmc[instance])
    {
      BSP_SD_ReadCpltCallback(instance);
    }
    instance ++;
  }while (instance < SD_INSTANCES_NBR);
}

#else /* (USE_HAL_SD_REGISTER_CALLBACKS == 1) */

/**
  * @brief SD Abort callbacks
  * @param hsd  SD handle
  * @retval None
  */
void HAL_SD_AbortCallback(SD_HandleTypeDef *hsd)
{
  uint32_t instance = 0;

  do
  {
    if (hsd == &hsd_sdmmc[instance])
    {
      BSP_SD_AbortCallback(instance);
    }
    instance ++;
  }while (instance < SD_INSTANCES_NBR);
}

/**
  * @brief Tx Transfer completed callbacks
  * @param hsd  SD handle
  * @retval None
  */
void HAL_SD_TxCpltCallback(SD_HandleTypeDef *hsd)
{
  uint32_t instance = 0;

  do
  {
    if (hsd == &hsd_sdmmc[instance])
    {
      BSP_SD_WriteCpltCallback(instance);
    }
    instance ++;
  }while (instance < SD_INSTANCES_NBR);
}

/**
  * @brief Rx Transfer completed callbacks
  * @param hsd  SD handle
  * @retval None
  */
void HAL_SD_RxCpltCallback(SD_HandleTypeDef *hsd)
{
  uint32_t instance = 0;

  do
  {
    if (hsd == &hsd_sdmmc[instance])
    {
      BSP_SD_ReadCpltCallback(instance);
    }
    instance ++;
  }while (instance < SD_INSTANCES_NBR);
}
#endif /* (USE_HAL_SD_REGISTER_CALLBACKS == 1) */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
